Repository: meta-secret/meta-secret-mobile
Catalog: MetaSecret/Resources/*.lproj/Localizable.strings
Languages: ru

# whatIs
source: Distributed, Self-hosted, Passwordless manager of secrets and passwords
ru: Это как секрет, только мета! Децентрализованный цифровой менеджер паролей и секретов.

# personalCloud
source: Personal Storage
ru: Личное хранилище

# personalCloudDescription
source: All passwords and secret information is stored only on your devices and securely protected with encryption standards RSA and AES
ru: Все пароли и секретная информация хранятся ТОЛЬКО на ваших устройствах и надежно защищены по стандартам шифрования RSA и AES

source: Distributed Storage
ru: Децентрализованное хранилище

# distributedStorageDescription
source: By adding more devices, you create your own personal cloud to manage passwords and secrets that consists of your devices
ru: Подключая дополнительные устройства, вы создаете персональное облако для управления паролями, состоящее из ваших устройств, доступ к которому есть только у вас (товарищь майор точно будет недоволен)

# backup
source: Easy access and reliable backup
ru: Удобный доступ и резервные копии

# backupDescription
source: Even if you lose one of the devices, you can always get access to your passwords from the rest of the devices in your network.
ru: Даже если вы потеряете одно из устройств, вы сможете получить доступ к своим паролям из оставшихся устройств без регистрации и СМС

# passwordLess
source: Passwordless Login
ru: Беспарольный доступ

# passwordLessDescription
source: Your secret is acessed with your defined authentication method like: FingerPrint, FaceID or PIN-code
ru: Для доступа к вашим секретам вы можете использовать ваши стандартные методы авторизации: Отпечаток пальца, FaceID, или PIN

source: Get started!
ru: Начать!

# loginTitle
source: Choose a unique nickname for login.
ru: Чтобы начать работу, выберите уникальное имя (никнейм).

# yourName
source: Your unique nickname
ru: Ваш уникальный никнейм

# letsgo
source: Let's get started!
ru: Вперед!

# wannaJoin
source: The name is already taken. If it's your nickname, please add the device to your network.
ru: Мы обнаружили, что это имя уже занято. Если оно ваше, то добавьте устройство в свою сеть.

# chooseAnotherName
source: The name is already taken. Would you like to choose another one?
ru: Мы обнаружили, что это имя уже занято. Вы можете добавить его в свою сеть или выбрать другое имя. Сменить?

source: Rename
ru: Переименовать

# declinedRequest
source: The Join request declined. Please choose another name.
ru: Пожалуйста, выберите другое имя. Мы обнаружили, что это имя уже занято и запрос на присоединение был отклонен.

# waitingForApproval
source: This device is waiting for approval to join the network.
ru: Это устройство ожидает присоединения в вашу сеть.

# pleaseAcceptRequest
source: Waiting for approval. Please accept the join request or the other device.
ru: Это устройство ожидает присоединения. Для продолжения, откройте приложение на первом устройстве и одобрите этот запрос на присоединение.

source: Secrets
ru: Секреты

source: Devices
ru: Устройства

# doYouWannaAccept
source: Multiple devices waiting for approval. Would you like to accept the request?
ru: Несколько устройств ожидают подтверждения на присоединение. Хотите разрешить?

source: Accept
ru: Разрешить

source: Decline
ru: Отказать

source: Pending...
ru: Ожидает подключения...

# declined
source: Decine
ru: Отказано

source: Member
ru: Участник

# noSecrets
source: No secrets yet!
ru: Пока у вас нет секретов!

# hmmm
source: Hmmm.... no devices... are you a magician?
ru: Хмммм.... нет девайсов... Вы волшебник?

# yourNick
source: Your Nickname:
ru: Ваш никнейм:

source: Your Devices:
ru: Ваши устройства:

source: Your Secrets:
ru: Ваши секреты:

# createCluster
source: Create your own network of devices to keep secrets secure
ru: Создайте собственную распределенную сеть устройств для безопасного хранения секретов.

# onlyOneDevice
source: There is only one device in your network! • We recommend adding more devices to provide better fault tolerance • Just install this app on other your devices and use your nickname: %@, to join the network
ru: Зарегистрировано лишь одно устройство! • При потере этого устройства, вы потеряете доступ ко всем своим паролям! Мы рекомендуем подключить дополнительные устройства, чтобы обеспечить большую отказоустойчивость • Просто установите это приложение на большем количестве устройств и используйте ваш никнейм: %@

# pleaseInstall
source: Please install this app on %@ additional devices!
ru: Пожалуйста, установите это приложение еще на %@ устройствах!

# howToAdd
source: How to add a device to your network?
ru: Как добавить устройство в сеть?

# stepsToAdd
source: 1. Download MetaSecret app on a new device. 2. Register with your nickname: %@ 3. Accept a join request from a device that already a member of the network. 4. Repeat on other devices.
ru: 1. Скачать программу MetaSecret на новом устройстве. 2. При авторизации введите ваше имя: %@ 3. Принять запрос на подключение с этого устройства. 4. Повторите еще раз на оставшихся устройствах. 5. Или воспользуйтесь QR кодом

source: Add
ru: Добавить

# deviceAdding
source: Adding device process
ru: Процесс добавления устройства

# pleaseApprove
source: Please, accept the join request, if this is your device.
ru: Одобрите запрос на подключение, если это ваше устройство.

# addSecret
source: Add secret/password
ru: Добавить секрет

# addDescription
source: Add description for secret
ru: Добавьте описание для секрета

source: Description
ru: Описание

source: Add password
ru: Добавьте пароль

source: Password
ru: Пароль

# splitInstruction
source: We splited your secret on three parts. Encrypted each one and already stored the first part on this device.
ru: Мы разделили ваш пароль на три части. Зашифровали каждую из них и уже сохранили первую на этом устройстве.

# splitInstructionLocal
source: You have only one device, because of it we will save your secret locally.
ru: Вы используете всего одно устройство, поэтому пароль будет сохранен только локально.

# selectSecond
source: Select device to store the second part
ru: Выберите устройство, чтобы сохранить вторую часть

# selectSecondButton
source: Select second device
ru: Выберите второе устройство

# selectThird
source: Select device to store the third part
ru: Выберите устройство, чтобы сохранить третью часть

# selectThirdButton
source: Select third device
ru: Выберите третье устройство

source: SPLIT
ru: РАЗДЕЛИТЬ

# selectDevice
source: Select devices to store other parts
ru: Выберите устройства, чтобы сохранить оставшиеся части пароля

# selectDeviceButton
source: Select devices
ru: Выбрать устройства

# selectDeviceButtonLocal
source: Save
ru: Сохранить

# notSplitedMessage
source: Split process has not been completed. We gonna save your secret locally only. There is a big chance of data loss. Would like to quit?
ru: Вы не завершили процесс распределения секрета по устройствам. Если вы уйдете, пароль будет сохранен ТОЛЬКО на данном устройстве. Что увеличивает риск потерять секреты вместе с утерей жтого устройства. Все равно выйти?

source: Edit
ru: Изменить

source: RESTORE
ru: ВОССТАНОВИТЬ

source: Edit Secret
ru: Изменить секрет

source: Success
ru: Успешно

# successSplited
source: Secret has been splited, encoded and distributed successfully!
ru: Секрет был разделен, зашифрован и успешно распеределен по вашим устройствам!

source: Cancel
ru: Отмена

source: Error
ru: Ошибка

source: Warning
ru: Предупреждение

# commonError
source: Oops, something went wrong
ru: Ой, что-то пошло не так

# networkError
source: Server error
ru: Ошибка на сервере

# registerError
source: Registration error
ru: Ошибка регистрации

# vaultError
source: Getting Vault Error
ru: Ошибка получения Vault

# userSignatureError
source: Curent User Error
ru: Ошибка текущего пользователя

# distributionDBError
source: Data Base distribution error
ru: Ошибка распределения данных в БД

# splitError
source: Splitting error
ru: Ошибка разбиения пароля

# wannaLogin
source: This name already taken. Want to login?
ru: Это имя уже занято. Хотите войти?

# enterName
source: Enter your nickname
ru: Пожалуйста, введите ваше имя (никнейм)

# sww
source: Something wrong
ru: Что-то пошло не так

# atLeast3
source: Not enough devices connected. It's recommended to have several devices in your network, to reduce the risk of data loss.
ru: Подключено недостаточное количество устройств. Мы сохранили ваш секрет, но желательно создать собственную сеть из трех устройств, чтобы исключить риск потери всех данных при утери единственного устройства.

# sentShareTitle
source: Share has been sent!
ru: Успешно отправлено!

# sentShareMessage
source: Secind share has been sent successfully on device %@
ru: Вторая часть пароля успешно отправлена на устройство %@

# chooseDevices
source: Please, select device to distribute other parts of your secret
ru: Пожалуйста, выберите устройства, на которые мы отправим оставшиеся части секрета

# generateUserError
source: Generating of user's signature is FAILED
ru: Ошибка генерации юзер сигнатур

# distributeError
source: Distribution is FAILED
ru: Ошибка дистрибьюции

source: Restore error
ru: Ошибка восстановления пароля

source: Encode error
ru: Ошибка кодирования

# noMainUserError
source: No main user
ru: Нет основного пользователя

# objectToJsonError
source: Parse object to Json error
ru: Ошибка перекодировки объекта в Json

# cantRestore
source: Can't restore password
ru: Не получается восстановить пароль

# cantClaim
source: Can't finish claim request
ru: Запустите приложение на втором устройстве, чтоб восстановить пароль!
